
Процедура ОбработкаПроведения(Отказ, Режим)
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(КассаОстатки.СуммаОстаток, 0) КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.Касса.Остатки(&Период, ) КАК КассаОстатки";
	
	Период = МоментВремени();
	
	Запрос.УстановитьПараметр("Период", Период);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		Нехватка = Сумма - ВыборкаДетальныеЗаписи.СуммаОстаток;
		
		Если Нехватка > 0 Тогда
		
			Отказ = Истина;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не хватает денег в кассе!! Нехватка " + Нехватка + " у.е.";
			Сообщение.Поле = "Сумма";
			Сообщение.ПутьКДанным = "Объект";
			Сообщение.КлючДанных = Ссылка;
			Сообщение.Сообщить();
			
			Возврат;
			
		КонецЕсли; 
		
	КонецЦикла;
	
	Движения.Касса.Записывать = Истина;
    Движение = Движения.Касса.Добавить();
    Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
    Движение.Период = Дата;
    Движение.Сумма = Сумма;
    

	Движения.Взаиморасчеты.Записывать = Истина;
    Движение = Движения.Взаиморасчеты.Добавить();
    Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
    Движение.Период = Дата;
    Движение.Контрагент = Контрагент;
    Движение.Сумма = Сумма;


КонецПроцедуры



//Процедура ОбработкаПроведения(Отказ, Режим)


//	Движения.Касса.Записывать = Истина;
//    Движение = Движения.Касса.Добавить();
//    Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
//    Движение.Период = Дата;
//    Движение.Сумма = Сумма;
//    

//	Движения.Взаиморасчеты.Записывать = Истина;
//    Движение = Движения.Взаиморасчеты.Добавить();
//    Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
//    Движение.Период = Дата;
//    Движение.Контрагент = Контрагент;
//    Движение.Сумма = Сумма;


//КонецПроцедуры


