
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьТекущийОстатокНаСервере();
	
КонецПроцедуры

//--------------------------------------------------------
&НаКлиенте
Процедура ОбновитьТекущийОстаток(Команда)
	ОбновитьТекущийОстатокНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьТекущийОстатокНаСервере()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(КассаОстатки.СуммаОстаток, 0) КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.Касса.Остатки(&Дата, ) КАК КассаОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(КассаОбороты.СуммаПриход, 0) КАК ОборотПриход,
	|	ЕСТЬNULL(КассаОбороты.СуммаРасход, 0) КАК ОборотРасход
	|ИЗ
	|	РегистрНакопления.Касса.Обороты(&Дата1, &Дата2, , ) КАК КассаОбороты";
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	Запрос.УстановитьПараметр("Дата1", ДобавитьМесяц(НачалоМесяца(ТекущаяДата()),-1));
	Запрос.УстановитьПараметр("Дата2", (НачалоМесяца(ТекущаяДата())-1));
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ВыборкаДетальныеЗаписи = МассивРезультатов.Получить(0).Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		ТекущийОстаток = ВыборкаДетальныеЗаписи.СуммаОстаток;
		
	КонецЦикла;
	
	ВыборкаДетальныеЗаписи = МассивРезультатов.Получить(1).Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		ОборотПриход = ВыборкаДетальныеЗаписи.ОборотПриход;
		ОборотРасход = ВыборкаДетальныеЗаписи.ОборотРасход;
		
	КонецЦикла;
	
КонецПроцедуры


//--------------------------------------------------------

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ПолучитьТекущийОстаток",60,Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьТекущийОстаток() Экспорт 

	ОбновитьТекущийОстатокНаСервере();

КонецПроцедуры // ПолучитьТекущийОстаток()


