&НаСервере
Процедура Заполнить_НаСервере()

	ДокОбъект = РеквизитФормыВЗначение("Объект");

	ДокОбъект.ЗаполнитьСостав();

	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");

КонецПроцедуры

&НаКлиенте
Процедура Заполнить_(Команда)

	Если (Объект.Проведен = Истина) Тогда

		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьЗавершение", ЭтотОбъект), "Заполнять можно только непроведенный документ. Снять документ с проводки?", РежимДиалогаВопрос.ДаНет);

		Возврат;

	КонецЕсли;

	Заполнить_НаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗавершение(Ответ, ДопПараметры) Экспорт

	Если (Ответ = КодВозвратаДиалога.Да) Тогда

		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.ОтменаПроведения));
		Заполнить_НаСервере();

	КонецЕсли;

КонецПроцедуры

